app/views/OWS/Information/QueryHotelInformation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:inf="http://webservices.micros.com/ows/5.1/Information.wsdl">
   <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <inf:HotelInformationRequest>
         <inf:HotelInformationQuery chainCode="{chainCode}" hotelCode="{hotelCode}"></inf:HotelInformationQuery>
      </inf:HotelInformationRequest>
   </soapenv:Body>
</soapenv:Envelope>